Revit 2027 API
BuiltInFailures.SketchFailures.LoopIntersect Property
 Lines cannot intersect each other. The highlighted lines currently intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoopIntersect { get; }
Public Shared ReadOnly Property LoopIntersect As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoopIntersect {
	FailureDefinitionId^ get ();
}
static member LoopIntersect : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace